lynchzilla/repository_lpc1769_adafruit_320x240_lcd_display_driver/lcd_320x240_display/lcddriver.c
	uint8_t		*FontTable[] = {(uint8_t *)FONT8x8,		// pointer to SMALL font
								(uint8_t *)FONT8x16,	// pointer to MEDIUM font
								(uint8_t *)FONT16x24};	// pointer to LARGE font

	uint16_t				i,j;						// loop counters
	uint16_t				nCols;						// number of columns in a character
	uint16_t				nRows;						// number of rows in a character
	uint16_t				nBytes;						// total number of bytes in a character
	uint8_t					PixelRow;					// temporary storage of a pixel row
	uint8_t					Mask;						// mask used to inspect each pixel in a row
	uint8_t					*pFont;						// pointer to beginning of the font table
	uint8_t					*pChar;						// pointer to each row of the character

	// get pointer to the beginning of the selected font table
	pFont = (uint8_t *)FontTable[s];

	// get the nColumns, nRows and nBytes from 1st line of font table
	nCols = *pFont;
	nRows = *(pFont + 1);
	nBytes = *(pFont + 2);

	// get pointer to the first byte of the desired character
	pChar = pFont + (nBytes * (c - 0x1F));

	// specify the controller drawing box according to those limits
	writeRegister(TFTLCD_HOR_START_AD, x);					// R50h - Horizontal Address Start Position
	writeRegister(TFTLCD_HOR_END_AD, x + nCols - 1);		// R51h - Horizontal Address End Position
	writeRegister(TFTLCD_VER_START_AD, y);					// R52h - Vertical Address Start Position
	writeRegister(TFTLCD_VER_END_AD, y + nRows - 1);		// R53h - Vertical Address End Position

    // Set the GRAM address (x,y) and then select the RW_GRAM register (R22h)
	goTo(x, y);

    // select the chip
	FIO_ClearValue(LCD_PORT0, _BIT(LCD_CS));

	// loop on each byte in the font character
	for (i = 0; i < nBytes; i++) {

		// copy pixel byte from font table and then increment pointer
		PixelRow = *pChar++;

		// loop on each pixel in the byte (left to right)
		Mask = 0x80;
		for (j = 0; j < 8; j++) {
			// if pixel bit set, use foreground color; else use the background color
			writeData_unsafe(((PixelRow & Mask) == 0) ? bColor : fColor);
			Mask = Mask >> 1;
		}
	}

	// restore the controller drawing box to full size
	writeRegister(TFTLCD_HOR_START_AD, 0);					// R50h - Horizontal Address Start Position
	writeRegister(TFTLCD_HOR_END_AD, TFTLCD_WIDTH);			// R51h - Horizontal Address End Position
	writeRegister(TFTLCD_VER_START_AD, 0);					// R52h - Vertical Address Start Position
	writeRegister(TFTLCD_VER_END_AD, TFTLCD_HEIGHT);		// R53h - Vertical Address End Position

	// de-select the chip
	FIO_SetValue(LCD_PORT0, _BIT(LCD_CS));
}


// ***********************************************************************************************
//   drawString - Draws a null-terminated string c starting at(x0,y0) in the color specified
//
//		Inputs: x0    = row address (0 .. 131)
// 				y0    = column address (0 .. 131)
// 				c 	  = null-terminated string
// 				color = 16-bit color value rrrrrggggggbbbbb
//
// 		Returns: nothing
//
//   Note: if you run past the edges, there will be weird wrap-around effects
//         function will overrun and fail if the string is not null-terminated
// ***********************************************************************************************
void drawString(uint16_t x, uint16_t y, char *c, uint16_t fColor, uint16_t bColor, uint8_t s)
{
	extern const uint8_t	FONT8x8[97][8];				// external Font table - size = 0 SMALL
	extern const uint8_t	FONT8x16[97][8];			// external Font table - size = 1 MEDIUM
	extern const uint8_t	FONT16x24[97][16];			// external Font table - size = 2 LARGE

	uint8_t		*pFont;									// pointer to beginning of the font table
	uint16_t	CharWidth;								// 3 of pixels between characters
	uint8_t		*FontTable[] = {(uint8_t *)FONT8x8,		// pointer to SMALL font
								(uint8_t *)FONT8x16,	// pointer to MEDIUM font
								(uint8_t *)FONT16x24};	// pointer to LARGE font

	// get pointer to the beginning of the selected font table
	pFont = (uint8_t *)FontTable[s];

	// get the character spacing from 1st line of font table
	CharWidth = *(pFont + 3);

	// draw the string (Warning: will overrun if string is not null-terminated)
	while (*c != 0) {
		drawChar(x, y, *c++, fColor, bColor, s);
		x += CharWidth;
	}
}


// ***********************************************************************************************
//   drawCircle - Draws a circle outline in the specified color at center (x0,y0) with radius r
//
//		Inputs: x0    = row address (0 .. 131)
// 				y0    = column address (0 .. 131)
// 				r 	  = radius in pixels
// 				color = 16-bit color value rrrrrggggggbbbbb
//
// 		Returns: nothing
//
// Author: Jack Bresenham IBM, Winthrop University (Father of this algorithm, 1962)
//
// Note: taken verbatim Wikipedia article on Bresenham's line algorithm
//       http://www.wikipedia.org
// ***********************************************************************************************
void drawCircle(uint16_t x0, uint16_t y0, uint16_t r, uint16_t color)
{
	int f = 1 - r;
	int ddF_x = 0;
	int ddF_y = -2 * r;
	int x = 0;
	int y = r;

	drawPixel(x0, y0 + r, color);
	drawPixel(x0, y0 - r, color);
	drawPixel(x0 + r, y0, color);
	drawPixel(x0 - r, y0, color);

	while (x < y) {
		if (f >= 0) {
			y--;
			ddF_y += 2;
			f += ddF_y;
		}
		x++;
		ddF_x += 2;
		f += ddF_x + 1;

		drawPixel(x0 + x, y0 + y, color);
		drawPixel(x0 - x, y0 + y, color);
		drawPixel(x0 + x, y0 - y, color);
		drawPixel(x0 - x, y0 - y, color);
		drawPixel(x0 + y, y0 + x, color);
		drawPixel(x0 - y, y0 + x, color);
		drawPixel(x0 + y, y0 - x, color);
		drawPixel(x0 - y, y0 - x, color);
	}
}


// ***********************************************************************************************
//   fillCircle - Fills a circle in the specified color at center (x0,y0) with radius r
//
//		Inputs: x0    = row address (0 .. 131)
// 				y0    = column address (0 .. 131)
// 				r 	  = radius in pixels
// 				color = 16-bit color value rrrrrggggggbbbbb
//
// 		Returns: nothing
// ***********************************************************************************************
void fillCircle(uint16_t x0, uint16_t y0, uint16_t r, uint16_t color)
{
	int16_t f = 1 - r;
	int16_t ddF_x = 1;
	int16_t ddF_y = -2 * r;
	int16_t x = 0;
	int16_t y = r;

