lynchzilla/repository_lpc1769_adafruit_320x240_lcd_display_driver/lcd_320x240_display/lcddriver.c
	drawVerticalLine(x0, y0-r, 2*r+1, color);

	while (x<y) {
		if (f >= 0) {
			y--;
			ddF_y += 2;
			f += ddF_y;
		}
		x++;
		ddF_x += 2;
		f += ddF_x;

		drawVerticalLine(x0+x, y0-y, 2*y+1, color);
		drawVerticalLine(x0-x, y0-y, 2*y+1, color);
		drawVerticalLine(x0+y, y0-x, 2*x+1, color);
		drawVerticalLine(x0-y, y0-x, 2*x+1, color);
	  }
}


// ***************************************************************************************************
// *  fillScreen - fills entire screen with the specified color
// *
// *		Inputs: color = 16-bit fill color value  (rrrrrggggggbbbbb)
// *
// *	    Returns: nothing
// ********************************************************************************************
void fillScreen(uint16_t color)
{
	uint32_t	i = TFTLCD_WIDTH * TFTLCD_HEIGHT;

	// go to top-left corner (0,0)
	goHome();

	// select the chip
	FIO_ClearValue(LCD_PORT0, _BIT(LCD_CS));

	// write to every pixel on the screen
	while (i--) {
		writeData_unsafe(color);
	}

	// de-select the chip
	FIO_SetValue(LCD_PORT0, _BIT(LCD_CS));
}


// ***************************************************************************************************
//    drawRect - draws a NON-filled rectangle in the specified color from (x, y) to (x + w, y + h)
//
//  		Inputs: x     = horizontal address - top left corner  (0..239)
//  				y     = vertical address   - top left corner  (0..319)
//  				w     = width in pixels
//  				h     = height in pixels
//  				color = 16-bit fill color value  (rrrrrggggggbbbbb)
//
//  	    Returns: nothing
//
// ********************************************************************************************
void drawRect(uint16_t x, uint16_t y, uint16_t w, uint16_t h, uint16_t color)
{
	// smarter version
	  drawHorizontalLine(x, y, w, color);
	  drawHorizontalLine(x, y+h-1, w, color);
	  drawVerticalLine(x, y, h, color);
	  drawVerticalLine(x+w-1, y, h, color);
}


// ************************************************************************************************
//    fillRect - draws a filled rectangle in the specified color from (x0,y0) to (x0 + w, y0 + h)
//
//  		Inputs: x     = horizontal address - top left corner (0..239)
//  				y     = vertical address   - top left corner (0..319)
//  				w     = width in pixels
//  				h     = height in pixels
//  				color = 16-bit fill color value  (rrrrrggggggbbbbb)
//
//  	    Returns: nothing
//
//      Notes:
//
//      The best way to fill a rectangle is to take advantage of the "wrap-around" feature
//      built into the Ilitek ILI9325 controller. By defining a drawing box, the memory can
//      be simply filled by successive memory writes until all pixels have been illuminated.
//
//      Author: James P Lynch July 7, 2007
// ************************************************************************************************
void fillRect(uint16_t x0, uint16_t y0, uint16_t w, uint16_t h, uint16_t color)
{
	uint16_t	x1, y1;
	uint16_t	pixelCount;

	// locate opposite corner of rectangle
	x1 = x0 + w - 1;
	y1 = y0 + h - 1;

	// specify the controller drawing box to the size of the rectangle
    writeRegister(TFTLCD_HOR_START_AD, x0);		// R50h - Horizontal Address Start Position
    writeRegister(TFTLCD_HOR_END_AD, x1);		// R51h - Horizontal Address End Position
    writeRegister(TFTLCD_VER_START_AD, y0);		// R52h - Vertical Address Start Position
    writeRegister(TFTLCD_VER_END_AD, y1);		// R53h - Vertical Address End Position

    // set GRAM address to (x0, y0)
    goTo(x0, y0);

    // select the chip
    FIO_ClearValue(LCD_PORT0, _BIT(LCD_CS));

    // loop on total number of pixels
	for (pixelCount = 0; pixelCount < (w * h); pixelCount++) {
		// write the color value to the pixel
		writeData_unsafe(color);
	}

	// return the controller drawing box to full screen
    writeRegister(TFTLCD_HOR_START_AD, 0);		// R50h - Horizontal Address Start Position
    writeRegister(TFTLCD_HOR_END_AD, 239);		// R51h - Horizontal Address End Position
    writeRegister(TFTLCD_VER_START_AD, 0);		// R52h - Vertical Address Start Position
    writeRegister(TFTLCD_VER_END_AD, 319);		// R53h - Vertical Address End Position

	// de-select the chip
    FIO_SetValue(LCD_PORT0, _BIT(LCD_RD));
}


// *************************************************************************************************
//   drawFastLine - draws a vertical or horizontal line in the specified color
//
//   Inputs:	x0    = starting x address (0 .. 239)
//   			y0    = starting y address (0 .. 319)
//          	l     = length in pixels
//   			color = 16-bit color value rrrrrggggggbbbbb
//              flag  = 0=horizontal, 1=vertical
//
//   Returns: nothing
// *************************************************************************************************
void drawFastLine(uint16_t x0, uint16_t y0, uint16_t length, uint16_t color, uint8_t rotflag)
{
	// temporarily set rotation to VERTICAL
	if (rotflag == VERTICAL) {
		setRotation(2);
	}

    writeRegister(TFTLCD_GRAM_HOR_AD, x0); 				// GRAM Address Set (Horizontal Address) (R20h)
    writeRegister(TFTLCD_GRAM_VER_AD, y0);				// GRAM Address Set (Vertical Address) (R21h)
    writeCommand(TFTLCD_RW_GRAM);  						// Write Data to GRAM (R22h)

	FIO_ClearValue(LCD_PORT0, _BIT(LCD_CS));					// select the chip
	FIO_SetValue(LCD_PORT0, _BIT(LCD_CD));						// CD high (idle)
	FIO_SetValue(LCD_PORT0, _BIT(LCD_RD));						// RD high (idle)
	FIO_SetValue(LCD_PORT0, _BIT(LCD_WR));						// WR high (idle)

	FIO_SetDir(LCD_PORT0, _SBF(0, 0xFF), LCD_OUTPUT);		// set data bus to write direction

	while (length--) {
		writeData_unsafe(color);
	}

	FIO_SetValue(LCD_PORT0, _BIT(LCD_CS));					// select the chip

	if (rotflag == VERTICAL) {
		setRotation(3);
	}
}


// *************************************************************************************************
//   drawVerticalLine - draws a vertical line in the specified color
//
//   Inputs:	x0     = starting x address (0 .. 239)
//   			y0     = starting y address (0 .. 319)
//          	length = length in pixels
//   			color  = 16-bit color value rrrrrggggggbbbbb
//
//   Returns: nothing
// *************************************************************************************************
void drawVerticalLine(uint16_t x0, uint16_t y0, uint16_t length, uint16_t color)
{
	// bail out if starting point is out-of-range
	if ((x0 >= TFTLCD_WIDTH) || (y0 >= TFTLCD_HEIGHT)) return;

	// draw the vertical line
	drawFastLine(x0, y0, length, color, 1);
}


// *************************************************************************************************
//   drawHorizontalLine - draws a horizontal line in the specified color
//
//   Inputs:	x0     = starting x address (0 .. 239)
//   			y0     = starting y address (0 .. 319)
//          	length = length in pixels
//   			color  = 16-bit color value rrrrrggggggbbbbb
//
//   Returns: nothing
// *************************************************************************************************
void drawHorizontalLine(uint16_t x0, uint16_t y0, uint16_t length, uint16_t color)
{
	// bail out if starting point is out-of-range
	if ((x0 >= TFTLCD_WIDTH) || (y0 >= TFTLCD_HEIGHT)) return;

	// draw the vertical line
	drawFastLine(x0, y0, length, color, 0);
}


// *************************************************************************************************
//   drawLine - draws a line in the specified color from (x0,y0) to (x1,y1)
//
//   Inputs:	x0 = starting x address (0 .. 239)
//   			y0 = starting y address (0 .. 319)
//          	x1 = ending x address   (0 .. 239)
//   			y1 = ending y address   (0 .. 319)
//   			color = 16-bit color value rrrrrggggggbbbbb
//   				where:  rrrrr  = 11111 full red
//   										:
//   						         00000 red is off
//
//   						gggggg = 111111 full green
//   										:
//   								 000000 green is off
//
//   						bbbbb  = 11111 full blue
//   										:
//   								 00000 blue is off
//
//   Returns: nothing
//
//   Note: good write-up on this algorithm in Wikipedia (search for Bresenham's line algorithm)
//         see lcd.h for some sample color settings
//
//   Authors: Dr. Leonard McMillan, Associate Professor UNC
//   		  Jack Bresenham IBM, Winthrop University (Father of this algorithm, 1962)
//
//   Note: taken verbatim from Professor McMillan's presentation:
//         http://www.cs.unc.edu/~mcmillan/comp136/Lecture6/Lines.html
// *************************************************************************************************
void drawLine(int16_t x0, int16_t y0, int16_t x1, int16_t y1, uint16_t color)
{
	int dy = y1 - y0;
	int dx = x1 - x0;
	int stepx, stepy;

	if (dy < 0) {
		dy = -dy; stepy = -1;
	} else {
		stepy = 1;
	}

