lynchzilla/repository_lpc1769_adafruit_320x240_lcd_display_driver/lcd_320x240_display/lcddriver.c
	if (dx < 0) {
		dx = -dx; stepx = -1;
	} else { stepx = 1;
	}

	dy <<= 1; 							// dy is now 2*dy
	dx <<= 1; 							// dx is now 2*dx

	drawPixel(x0, y0, color);

	if (dx > dy) {
		int fraction = dy - (dx >> 1); 	// same as 2*dy - dx

		while (x0 != x1) {
			if (fraction >= 0) {
				y0 += stepy;
				fraction -= dx; 		// same as fraction -= 2*dx
			}
		x0 += stepx;
		fraction += dy; 				// same as fraction -= 2*dy
		drawPixel(x0, y0, color);
		}
	} else {
		int fraction = dx - (dy >> 1);
		while (y0 != y1) {
			if (fraction >= 0) {
				x0 += stepx;
				fraction -= dy;
			}
		y0 += stepy;
		fraction += dx;
		drawPixel(x0, y0, color);
		}
	}
}


// ********************************************************************************
//   drawPixel -  draws a single pixel at the specified (x,y) address and color.
//
//   Parameters:  x:      horizontal address in pixels (0..239)
//                y:      vertical address in pixels (0..319)
//                color:  color value (16-bits)  RRRRRGGGGGGBBBBB
//
//   Returns:     nothing
// ********************************************************************************
void drawPixel(uint16_t x, uint16_t y, uint16_t color)
{
  if ((x >= 240) || (y >= 320)) return;
  writeRegister(TFTLCD_GRAM_HOR_AD, x); 		// GRAM Address Set (Horizontal Address) (R20h)
  writeRegister(TFTLCD_GRAM_VER_AD, y); 		// GRAM Address Set (Vertical Address) (R21h)
  writeCommand(TFTLCD_RW_GRAM);  				// Write color data to GRAM (R22h)
  FIO_ClearValue(LCD_PORT0, _BIT(LCD_CS));				// select the chip
  writeData_unsafe(color);						// write the color to GRAM
  FIO_SetValue(LCD_PORT0, _BIT(LCD_CS));				// de-select the chip
}


// *************************************************************************************************************
//   lcdInitDisplay -  initializes the ILI9325 LCD controller
//
//  					1. turns on PortA and PortC clocks
//  					2. sets PortA bits 0..7 as digital outputs (data bus)
//  					3. sets PortB bits 0..5 as digital outputs (control lines)
//  					4. idles all control lines
//                      5. resets the ILI9326 LCD controller
//  					6. sets up all required ILI9325 registers
//  					7. turns on the display
//
//   Parameters:  none
//
//   Returns:     nothing
// *************************************************************************************************************
void lcdInitDisplay(void)
{
	uint32_t	Count;			// loop counter

	static const uint16_t  regValues[51][2] =
		{
			{TFTLCD_START_OSC, 0x0001},				// R00h - start oscillator (need delay after)
			{TFTLCD_DELAYCMD, 50},					// delay 50 msec
			{TFTLCD_DRIV_OUT_CTRL, 0x0100},			// R01h - Driver Output Control
			{TFTLCD_DRIV_WAV_CTRL,0x0700},			// R02h - LCD Driving Control
			{TFTLCD_ENTRY_MOD,0x1030},				// R03h - Entry Mode
			{TFTLCD_RESIZE_CTRL,0x0000},			// R04h - Resize Control
			{TFTLCD_DISP_CTRL2,0x0202},				// R08h - Display Control 2
			{TFTLCD_DISP_CTRL3,0x0000},				// R09h - Display Control 3
			{TFTLCD_DISP_CTRL4,0x0000},				// R0Ah - Display Control 4
			{TFTLCD_RGB_DISP_IF_CTRL1,0x0000},		// R0Ch - RGB Display Interface Control 1
			{TFTLCD_FRM_MARKER_POS,0x0000},			// R0Dh - Frame Maker Position
			{TFTLCD_RGB_DISP_IF_CTRL2,0x0000},		// R0Fh - RGB Display Interface Control 2
			{TFTLCD_POW_CTRL1,0x0000},				// R10h - Power Control 1
			{TFTLCD_POW_CTRL2,0x0007},				// R11h - Power Control 2
			{TFTLCD_POW_CTRL3,0x0000},				// R12h - Power Control 3
			{TFTLCD_POW_CTRL4,0x0000},				// R13h - Power Control 4
			{TFTLCD_DELAYCMD, 200},					// delay 200 msec
			{TFTLCD_POW_CTRL1,0x1690},				// R10h - Power Control 1
			{TFTLCD_POW_CTRL2,0x0227},				// R11h - Power Control 2
			{TFTLCD_DELAYCMD, 50},					// delay 50 msec
			{TFTLCD_POW_CTRL3,0x001A},				// R12h - Power Control 3
			{TFTLCD_DELAYCMD, 50},					// delay 50 msec
			{TFTLCD_POW_CTRL4,0x1800},				// R13h - Power Control 4
			{TFTLCD_POW_CTRL7,0x002A},				// R29h - Power Control 7
			{TFTLCD_DELAYCMD, 50},					// delay 50 msec
			{TFTLCD_GAMMA_CTRL1,0x0000},			// R30h - Gamma Control 1
			{TFTLCD_GAMMA_CTRL2,0x0000},			// R31h - Gamma Control 2
			{TFTLCD_GAMMA_CTRL3,0x0000},			// R32h - Gamma Control 3
			{TFTLCD_GAMMA_CTRL4,0x206},				// R35h - Gamma Control 4
			{TFTLCD_GAMMA_CTRL5,0x808},				// R36h - Gamma Control 5
			{TFTLCD_GAMMA_CTRL6,0x0007},			// R37h - Gamma Control 6
			{TFTLCD_GAMMA_CTRL7,0x0201},			// R38h - Gamma Control 7
			{TFTLCD_GAMMA_CTRL8,0x0000},			// R39h - Gamma Control 8
			{TFTLCD_GAMMA_CTRL9,0x0000},			// R3Ch - Gamma Control 9
			{TFTLCD_GAMMA_CTRL10,0x0000},			// R3Dh - Gamma Control 10
			{TFTLCD_GRAM_HOR_AD,0x0000},			// R20h - Horizontal GRAM Address
			{TFTLCD_GRAM_VER_AD,0x0000},			// R21h - Vertical GRAM Address
			{TFTLCD_HOR_START_AD,0x0000},			// R50h - Horizontal Address Start Position
			{TFTLCD_HOR_END_AD,0x00EF},        		// R51h - Horizontal Address End Position
			{TFTLCD_VER_START_AD,0x0000},        	// R52h - Vertical Address Start Position
			{TFTLCD_VER_END_AD,0x13F},        		// R53h - Vertical Address End Position
			{TFTLCD_GATE_SCAN_CTRL1,0xA700},		// R60h - Driver Output Control 2
			{TFTLCD_GATE_SCAN_CTRL2,0x0003},		// R61h - Base Image Display Control
			{TFTLCD_GATE_SCAN_CTRL3,0x0000},   		// R6Ah - Vertical Scroll Control
			{TFTLCD_PANEL_IF_CTRL1,0x0010},			// R90h - Panel Interface Control 1
			{TFTLCD_PANEL_IF_CTRL2,0x0000},       	// R92h - Panel Interface Control 2
			{TFTLCD_PANEL_IF_CTRL3,0x0003},       	// R93h - Panel Interface Control 3
			{TFTLCD_PANEL_IF_CTRL4,0x1100},      	// R94h - Panel Interface Control 4
			{TFTLCD_PANEL_IF_CTRL5,0x0000},       	// R95h - Panel Interface Control 5
    		{TFTLCD_PANEL_IF_CTRL6,0x0000},       	// R96h - Panel Interface Control 6
    		{TFTLCD_DISP_CTRL1, 0x0133}      		// R07h - Display Control 1 - display on
		};

    // Enable GPIO Clock
    CLKPWR_ConfigPPWR(CLKPWR_PCONP_PCGPIO, ENABLE);

    // set GPIO ports P0.0 - P0.7 and P0.21 - P0.25 to output
	FIO_SetDir(LCD_PORT0, _SBF(0, 0x03E000FF), LCD_OUTPUT);

	//  reset the LCD controller
	reset();

	// set the RD, WR, CD, and CS control lines to the Idle state
	FIO_SetValue(LCD_PORT0, _BIT(LCD_RD));
	FIO_SetValue(LCD_PORT0, _BIT(LCD_WR));
	FIO_SetValue(LCD_PORT0, _BIT(LCD_CS));
	FIO_SetValue(LCD_PORT0, _BIT(LCD_CD));

