lynchzilla/repository_lpc1769_adafruit_320x240_lcd_display_driver/lcd_320x240_display/lcddriver.c
	// Set-up all ILI9325/ILI9328 registers per LadyAda's stored table regValues[51][2]
	// LadyAda's table-driven method is very space-efficient!
	for (Count = 0; Count < (sizeof(regValues) / 4); Count++)
		{
		if (regValues[Count][0] == TFTLCD_DELAYCMD) {
			lcdDelay(regValues[Count][1]);
		} else {
			writeRegister(regValues[Count][0], regValues[Count][1]);
		}
	}
}


// ****************************************************************************
//   reset -  resets the ILI9325 LCD controller
//
//   Parameters:  none
//
//   Returns:     nothing
// ****************************************************************************
void reset(void)
{
	//  reset the LCD controller
	FIO_SetValue(LCD_PORT0, _BIT(LCD_RST));			// set RST high
	lcdDelay(1);								    // delay 1 millisecond
	FIO_ClearValue(LCD_PORT0, _BIT(LCD_RST));		// set RST low
	lcdDelay(10);									// delay 10 milliseconds
	FIO_SetValue(LCD_PORT0, _BIT(LCD_RST));			// set RST high
	lcdDelay(50);								    // delay 50 milliseconds

	// re-sync
	writeData(0);
	writeData(0);
	writeData(0);
	writeData(0);
}


// *********************************************************************************************
//   setRotation -  Sets the GRAM access writing direction
//
//   Parameters:  dir: access writing direction (0..3).
//
//   Returns:     Nothing
//
//   Note:  default direction is 3 where (0,0) is top left and
//          pixel writing is from left to right then down.
//
//
//    (239,319)|----------------------|(000,319)   (000,000)|----------------------|(000,000)
//             |E@<-----------------@ |                     | @   @              @E|
//           Y |         ::           |                     | ^   ^              ^ |
//           | |         ::           |                     | |   |    ..        | |
//           | | @<-----------------@ |                     | |   |    ..        | |
//           V |                      |                     | |   |              | |
//             | @<-----------------@B|                     |B@   @              @ |
//    (239,000)|----------------------|(000,000)   (000,000)|----------------------|(000,000)
//
//                      dir = 0                                       dir = 1
//
//
//                                                 ( x,  y )        x ---->
//             |----------------------|            (000,000)|----------------------|(000,319)
//             | @              @   @B|                     |B@----------------->@ |
//             | |              |   | |                   y |                      |
//             | |      ..      |   | |                   | | @----------------->@ |
//             | |      ..      |   | |                   | |          :           |
//             | V              V   V |                   v |          :           |
//             |E@              @   @ |                     | @----------------->@E|
//             |----------------------|            (239,000)|----------------------|(239,319)
//                    dir = 2                                   dir = 3 (DEFAULT)
//
// *********************************************************************************************
void setRotation(uint8_t dir)
{
	rotation = dir;
    switch (dir) {
    case 0:
      writeRegister(TFTLCD_ENTRY_MOD, 0x1000);
      _width = TFTLCD_WIDTH;
      _height = TFTLCD_HEIGHT;
      break;
    case 1:
      _width = TFTLCD_WIDTH;
      _height = TFTLCD_HEIGHT;
      writeRegister(TFTLCD_ENTRY_MOD, 0x1018);
      break;
    case 2:
      _width = TFTLCD_WIDTH;
      _height = TFTLCD_HEIGHT;
      writeRegister(TFTLCD_ENTRY_MOD, 0x1028);
      break;
    case 3:
      _width = TFTLCD_WIDTH;
      _height = TFTLCD_HEIGHT;
      writeRegister(TFTLCD_ENTRY_MOD, 0x1030);
      break;
    default:
      break;
    }
}


// ****************************************************************************
//   setRotation -  returns the GRAM access writing direction
//
//   Parameters:  none
//
//   Returns:     access writing direction (0..3).
// ****************************************************************************
uint8_t getRotation(void)
{
  return rotation;
}


// **************************************************************************************
//   writeCommand -  select the ILI9325 index register prior to read/write operations.
//
//   Parameters:  c:   address of the selected register (00h..A5h)
//
//   Returns:     Nothing
// **************************************************************************************
void writeCommand(uint16_t c)
{
	// set the RD and WR to the Idle state
	// clear CS (selects the chip) and clear CD (allows selection of index register)
	FIO_SetValue(LCD_PORT0, _BIT(LCD_RD));
	FIO_SetValue(LCD_PORT0, _BIT(LCD_WR));
	FIO_ClearValue(LCD_PORT0, _BIT(LCD_CS));
	FIO_ClearValue(LCD_PORT0, _BIT(LCD_CD));

	// write msb of register (0x00) to data bus  (only bits 0..7 of Port A are changed)
	FIO_ClearValue(LCD_PORT0, _SBF(0,0xFF));

	// strobe the WR write line (data is latched on the rising-edge)
	FIO_ClearValue(LCD_PORT0, _BIT(LCD_WR));
	FIO_SetValue(LCD_PORT0, _BIT(LCD_WR));

	// write lsb of register to data bus  (only bits 0..7 of Port A are changed)
	FIO_SetValue(LCD_PORT0, c & 0x000000FF);
	FIO_ClearValue(LCD_PORT0, ~c & 0x000000FF);

	// strobe the WR write line  (data is latched on the rising-edge)
	FIO_ClearValue(LCD_PORT0, _BIT(LCD_WR));
	FIO_SetValue(LCD_PORT0, _BIT(LCD_WR));

	// all done, set CS (chip select) and CD (register select) high
	FIO_SetValue(LCD_PORT0, _BIT(LCD_CS));
	FIO_SetValue(LCD_PORT0, _BIT(LCD_CD));
}


// ****************************************************************************
//   readData -  Reads from the LCD RAM.
//
//   Parameters:  none
//
//   Returns:     nothing
//
//   Note: This assumes that you have already called writeCommand(register)
//         to select the GRAM register.
// ****************************************************************************
uint16_t readData(void)
{
	volatile uint16_t	Code = 0;

    // set the RD, WR, and RS to the Idle state
    // clear CS (selects the chip)
	FIO_SetValue(LCD_PORT0, _BIT(LCD_RD));
	FIO_SetValue(LCD_PORT0, _BIT(LCD_WR));
	FIO_ClearValue(LCD_PORT0, _BIT(LCD_CS));
	FIO_ClearValue(LCD_PORT0, _BIT(LCD_CD));

    // set the read direction for the data bus
	FIO_SetDir(LCD_PORT0, _SBF(0, 0xFF), LCD_INPUT);

