lynchzilla/repository_lpc1769_adafruit_320x240_lcd_display_driver/lcd_320x240_display/lcddriver.c
    // clear the RD read line to latch the upper 8-bits
	FIO_ClearValue(LCD_PORT0, _BIT(LCD_RD));

    // read msb of register from data bus
	Code = (FIO_ReadValue(LCD_PORT0) << 8) & 0xFF00;

    // set the RD line
	FIO_SetValue(LCD_PORT0, _BIT(LCD_RD));

    // strobe the RD read line to latch the upper 8-bits (data is latched on the rising-edge)
	FIO_ClearValue(LCD_PORT0, _BIT(LCD_RD));

    // read msb of register from data bus
	Code |= FIO_ReadValue(LCD_PORT0) & 0xFF00;

    // set the RD line
	FIO_SetValue(LCD_PORT0, _BIT(LCD_RD));

    // set the write direction for the data bus
	FIO_SetDir(LCD_PORT0, _SBF(0, 0xFF), LCD_OUTPUT);

    // all done, set CS (chip select) and RS (register select) high
	FIO_SetValue(LCD_PORT0, _BIT(LCD_CS));

    return Code;
}


// ****************************************************************************
//   writeData -  Writes to the LCD RAM.
//
//   Parameters:  d: the pixel color in RGB mode (5-6-5).
//
//   Returns:     Nothing
//
//   Note: This assumes that you have already called writeCommand(register)
//         to select the GRAM register.
// ****************************************************************************
void writeData(uint16_t d)
{
    // set the RD, WR, and RS to the Idle state
    // clear CS (selects the chip)
	FIO_SetValue(LCD_PORT0, _BIT(LCD_RD));
	FIO_SetValue(LCD_PORT0, _BIT(LCD_WR));
	FIO_ClearValue(LCD_PORT0, _BIT(LCD_CS));
	FIO_ClearValue(LCD_PORT0, _BIT(LCD_CD));

	// set 8-bit data bus to write mode
	FIO_SetDir(LCD_PORT0, _SBF(0, 0xFF), LCD_OUTPUT);

	// write msb of command to data bus  (only bits 0..7 of Port A are changed)
	FIO_SetValue(LCD_PORT0, (d >> 8) & 0x000000FF);
	FIO_ClearValue(LCD_PORT0, ~(d >> 8) & 0x000000FF);

	// strobe the WR write line (data is latched on the rising-edge)
	FIO_ClearValue(LCD_PORT0, _BIT(LCD_WR));
	FIO_SetValue(LCD_PORT0, _BIT(LCD_WR));

	// write lsb of command to data bus  (only bits 0..7 of Port A are changed)
	FIO_SetValue(LCD_PORT0, d & 0x000000FF);
	FIO_ClearValue(LCD_PORT0, ~d & 0x000000FF);

	// strobe the WR write line  (data is latched on the rising-edge)
	FIO_ClearValue(LCD_PORT0, _BIT(LCD_WR));
	FIO_SetValue(LCD_PORT0, _BIT(LCD_WR));

	// de-select the chip
	FIO_SetValue(LCD_PORT0, _BIT(LCD_CS));

}


// *********************************************************************************
//   writeData_unsafe -  Writes to the LCD RAM.
//
//   Parameters:  d: the pixel color in RGB mode (5-6-5).
//
//   Returns:     Nothing
//
//   Note: This assumes that you have already called writeCommand(register)
//         to select the GRAM register (R22h).
//
//         This also assumes that:  LCD_RD = Bit_SET
//  	                            LCD_CD = Bit_SET
//  	                            LCD_CS = Bit_RESET
//
//  	   The data bus is always in "write" mode, except during readRegister()
//         where it is switched to "read" mode then restored to "write" mode
//         before exiting.
// *********************************************************************************
void writeData_unsafe(uint16_t d)
{
	// write msb of command to data bus  (only bits 0..7 of Port A are changed)
	FIO_SetValue(LCD_PORT0, (d >> 8) & 0x000000FF);
	FIO_ClearValue(LCD_PORT0, ~(d >> 8) & 0x000000FF);

	// strobe the WR write line (data is latched on the rising-edge)
	FIO_ClearValue(LCD_PORT0, _BIT(LCD_WR));
	FIO_SetValue(LCD_PORT0, _BIT(LCD_WR));

	// write lsb of command to data bus  (only bits 0..7 of Port A are changed)
	FIO_SetValue(LCD_PORT0, d & 0x000000FF);
	FIO_ClearValue(LCD_PORT0, ~d & 0x000000FF);

	// strobe the WR write line  (data is latched on the rising-edge)
	FIO_ClearValue(LCD_PORT0, _BIT(LCD_WR));
	FIO_SetValue(LCD_PORT0, _BIT(LCD_WR));
}


// ****************************************************************************
//   readRegister -  Reads the selected LCD Register.
//
//   Parameters:  addr:   address of the selected register.
//
//   Returns:     Value:  16-bit register value
// ****************************************************************************
uint16_t readRegister(uint16_t addr)
{
	uint16_t	Data = 0;

	writeCommand(addr);
	Data = readData();
	return(Data);
}


// ****************************************************************************
//   writeRegister -  Writes the selected ILI9325/ILI9328 register.
//
//   Parameters:  addr:   address (index) of the selected register.
//                data:   16-bit data to be written.
//
//   Returns:     nothing
// ****************************************************************************
void writeRegister(uint16_t addr, uint16_t data)
{
	// set the RD and WR to the Idle state
	// clear CS (selects the chip) and clear CD (allows selection of index register)
	FIO_SetValue(LCD_PORT0, _BIT(LCD_RD));
	FIO_SetValue(LCD_PORT0, _BIT(LCD_WR));
	FIO_ClearValue(LCD_PORT0, _BIT(LCD_CS));
	FIO_ClearValue(LCD_PORT0, _BIT(LCD_CD));

	// write msb of index register addr (always 0x00) to data bus  (only bits 0..7 of Port0 are changed)
	FIO_ClearValue(LCD_PORT0, _SBF(0,0xFF));

	// strobe the WR write line (data is latched on the rising-edge)
	FIO_ClearValue(LCD_PORT0, _BIT(LCD_WR));
	FIO_SetValue(LCD_PORT0, _BIT(LCD_WR));

	// write lsb of index register addr to data bus  (only bits 0..7 of Port0 are changed)
	FIO_SetValue(LCD_PORT0, addr & 0x000000FF);;
	FIO_ClearValue(LCD_PORT0, ~addr & 0x000000FF);;

	// strobe the WR write line  (data is latched on the rising-edge)
	FIO_ClearValue(LCD_PORT0, _BIT(LCD_WR));
	FIO_SetValue(LCD_PORT0, _BIT(LCD_WR));

	// index register selected, set CD (register select) high
	FIO_SetValue(LCD_PORT0, _BIT(LCD_CD));

	// write msb of data to data bus  (only bits 0..7 of Port A are changed)
	FIO_SetValue(LCD_PORT0, (data >> 8) & 0x000000FF);
	FIO_ClearValue(LCD_PORT0, ~(data >> 8) & 0x000000FF);

	// strobe the WR write line (data is latched on the rising-edge)
	FIO_ClearValue(LCD_PORT0, _BIT(LCD_WR));
	FIO_SetValue(LCD_PORT0, _BIT(LCD_WR));

	// write lsb of data to data bus  (only bits 0..7 of Port A are changed)
	FIO_SetValue(LCD_PORT0, data & 0x000000FF);
	FIO_ClearValue(LCD_PORT0, ~data & 0x000000FF);

	// strobe the WR write line  (data is latched on the rising-edge)
	FIO_ClearValue(LCD_PORT0, _BIT(LCD_WR));
	FIO_SetValue(LCD_PORT0, _BIT(LCD_WR));

	// de-select the chip
	FIO_SetValue(LCD_PORT0, _BIT(LCD_CS));
}



// ****************************************************************************
//   lcdDelay -  Inserts a delay time. (warning: this hog-ties the CPU)
//
//   Parameters:  nCount: specifies the delay time in msec.
//
//   Returns:     Nothing
// ****************************************************************************
void lcdDelay(uint32_t nCount)
{
  volatile uint32_t index = 0;
  for(index = (2400 * nCount); index != 0; index--)
  {
  }
}


